
# Press the green button in the gutter to run the script.


# See PyCharm help at https://www.jetbrains.com/help/pycharm/

#Напишите 4 переменных которые буду обозначать следующие данные:
#Количество выполненных ДЗ (запишите значение 12)
#Количество затраченных часов (запишите значение 1.5)
#Название курса (запишите значение 'Python')
#Время на одно задание (вычислить используя 1 и 2 переменные)
#Выведите на экран(в консоль), используя переменные, следующую строку:
#Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.


hometask_done = 12
hours_spent = 1.5
course = 'Python'
time_for_one_task = 1.5/12
print('course: '+course + ', всего задач: '+ str(hometask_done) + ', затрачено часов: ' + str(hours_spent) + ', среднее время выполнениия : ' + str(time_for_one_task))

